// main.js - 메인 페이지 JS
$(function(){/// jQB /////////////////////////////////
	
	////////////*추가코드5*//////////////////////////////////////////////
	if(mobsts===1){
		$("#banner").css({marginTop:$("#top").innerHeight()+"px"});
	}/// if문 //////////////////////////////////////////////////////////
	
	//////////// 햄버거 버튼 클릭시 애니메이션 하기 /////////////////
	var hamsts=0;//햄버거버튼 상태(0-처음, 1-변경)
	var msts=0; /// 추가코드를 위한 추가 변수!!!!!!!!(잠금장치)
	$("#ham").click(function(){	
		////////////*추가코드1*///////////
		if(msts===1)return false;
		msts=1;
		////////////////////////////////
		
		// 햄버거 버튼 닫기버튼으로 변경하기////////////
		if(hamsts===0){
			// 1. 1번 막대 아래쪽으로 회전하기
			$("span",this).eq(0).animate({
				rotate:"45deg", top: "10px"
			},200);
			// 2. 2번 막대 중앙으로 사라지기
			$("span",this).eq(1).animate({
				width: "0", left: "20px"
			},200);
			// 3. 3번 막대 위쪽으로 회전하기
			$("span",this).eq(2).animate({
				rotate:"-45deg", top: "10px"
			},200);
			
			//// 햄버거 버튼 상태값 변경하기///
			hamsts=1;//닫기버튼 상태로!!!
			
			/// 전체 메뉴 박스 보이기 /////
			$("#menu").fadeIn(300);
			
			/// 배경 비디오 플레이 하기 ////
			if(mobsts===0){$("#menu>video").get(0).play();}
			// 비디오 태그 집합을 관리하는 메서드 -> get(n)
			// get(0) -> 첫번째 비디오
			// play() -> 비디오/오디오 요소를 재생하는 메서드
			
			/// 로고와 기본메뉴 숨기기 ///수정
			$("#logo").fadeTo(300,0);
			
			////////////*추가코드3*///////////////////////
			if(mobsts===0)$("#gnb").fadeTo(300,0);
			/////////////////////////////////////////////////
			// fadeTo(시간,오파,이징,함수) -> 특징: fadeOut과는 달리 투명도가 0이되어도 display:none되지 않는다!!!!!!!!!!
			
			
			
		}////////// 햄버거버튼 닫기버튼변경 if문 ///////////
		
		// 닫기 버튼 햄버거버튼으로 변경하기////////////
		else if(hamsts===1){
			// 1. 1번 막대 원위치
			$("span",this).eq(0).animate({
				rotate:"0deg", top: "0px"
			},200);
			// 2. 2번 원위치
			$("span",this).eq(1).animate({
				width: "40px", left: "0px"
			},200);
			// 3. 3번 원위치
			$("span",this).eq(2).animate({
				rotate:"0deg", top: "20px"
			},200);
			
			//// 햄버거 버튼 상태값 변경하기///
			hamsts=0;//햄버거버튼 상태로!!!
			
			/// 전체 메뉴 박스 숨기기 ////
			$("#menu").fadeOut(300);
			
			// 배경 비디오 멈추기
			if(mobsts===0){$("#menu>video").get(0).pause();}
			// pause() 메서드는 비디오/오디오 요소의 재생을 멈춤
			
			/// 로고와 기본메뉴 보이기 /// 수정
			$("#logo").fadeTo(300,1);
			
			///////*추가코드4*/////////////////////////
			if(mobsts===0)$("#gnb").fadeTo(300,1);
			/////////////////////////////////////////////
			
		}////////// 닫기버튼 햄버거버튼변경 else if문 ///////////
		
		////////////*추가코드2*//////////////////
		setTimeout(function(){msts=0;},200);
		//////////////////////////////////////////
		
	});//////////////// click ////////////////////////////////
	
	
});/////////// jQB /////////////////////////////////////
////////////////////////////////////////////////////////















